In [1]:
import pandas as pd

In [2]:
#T Dataframe CLeaning
T_df = pd.read_csv("T.csv")

In [3]:
T_df.head()

         Date       Open   High        Low      Close  Adj Close     Volume
0  2010-01-01  28.410000  28.73  25.059999  25.360001  14.211266  729998800
1  2010-02-01  25.670000  25.84  24.610001  24.809999  14.111450  578886600
2  2010-03-01  24.910000  26.57  24.709999  25.840000  14.697299  590401700
3  2010-04-01  26.049999  26.75  25.480000  26.059999  14.822426  640885700
4  2010-05-01  26.240000  26.43  23.780001  24.299999  14.045590  746316700

In [5]:
T_df = T_df.rename(columns = {'Adj Close': 'T'})
T_df.head()

         Date       Open   High        Low      Close          T     Volume
0  2010-01-01  28.410000  28.73  25.059999  25.360001  14.211266  729998800
1  2010-02-01  25.670000  25.84  24.610001  24.809999  14.111450  578886600
2  2010-03-01  24.910000  26.57  24.709999  25.840000  14.697299  590401700
3  2010-04-01  26.049999  26.75  25.480000  26.059999  14.822426  640885700
4  2010-05-01  26.240000  26.43  23.780001  24.299999  14.045590  746316700

In [6]:
T_clean = T_df[['Date','T']]
T_clean.head()

         Date          T
0  2010-01-01  14.211266
1  2010-02-01  14.111450
2  2010-03-01  14.697299
3  2010-04-01  14.822426
4  2010-05-01  14.045590

In [7]:
len(T_clean)

120

In [8]:
len(T_clean.dropna())

120